teleger/GD32L235-Demo/Template/Keil_project/SHT4X-5.3/sensirion_hw_i2c_implementation.c
/*
 * Copyright (c) 2018, Sensirion AG
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * * Redistributions of source code must retain the above copyright notice, this
 *   list of conditions and the following disclaimer.
 *
 * * Redistributions in binary form must reproduce the above copyright notice,
 *   this list of conditions and the following disclaimer in the documentation
 *   and/or other materials provided with the distribution.
 *
 * * Neither the name of Sensirion AG nor the names of its
 *   contributors may be used to endorse or promote products derived from
 *   this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#include "sensirion_arch_config.h"
#include "sensirion_common.h"
#include "sensirion_i2c.h"
#include "common_i2c_attr.h"

#ifdef GD32E230
#include "gd32e23x.h"
#endif

#ifdef GD32L235
#include "gd32l23x.h"
#endif

#include "systick.h"
#define SENSIR_STR "sensirion"
/*
 * INSTRUCTIONS
 * ============
 *
 * Implement all functions where they are marked as IMPLEMENT.
 * Follow the function specification in the comments.
 */

/**
 * Select the current i2c bus by index.
 * All following i2c operations will be directed at that bus.
 *
 * THE IMPLEMENTATION IS OPTIONAL ON SINGLE-BUS SETUPS (all sensors on the same
 * bus)
 *
 * @param bus_idx   Bus index to select
 * @returns         0 on success, an error code otherwise
 */
int16_t sensirion_i2c_select_bus(uint8_t bus_idx) {
    // IMPLEMENT or leave empty if all sensors are located on one single bus
    return STATUS_FAIL;
}

/**
 * Initialize all hard- and software components that are needed for the I2C
 * communication.
 */
void sensirion_i2c_init(void) {
    // IMPLEMENT
    sensirion_i2c_rcu_config();
    sensirion_i2c_gpio_config();
    sensirion_i2c_attribute_config();
}

/**
 * Release all resources initialized by sensirion_i2c_init().
 */
void sensirion_i2c_release(void) {
    // IMPLEMENT or leave empty if no resources need to be freed
}



/**
 * Execute one read transaction on the I2C bus, reading a given number of bytes.
 * If the device does not acknowledge the read command, an error shall be
 * returned.
 *
 * @param address 7-bit I2C address to read from
 * @param data    pointer to the buffer where the data is to be stored
 * @param count   number of bytes to read from I2C and store in the buffer
 * @returns 0 on success, error code otherwise
 */
int8_t sensirion_i2c_read(uint8_t address, uint8_t* data, uint16_t count) {
    // IMPLEMENT
    uint8_t ret = 0xff;
    ret = sensirion_i2c_ReadByte_timeout(address,data,count);
    printf("sensirion_i2c_read:%d\r\n",ret);
    if(ret != I2C_END)return STATUS_FAIL;
    return NO_ERROR;
}

/**
 * Execute one write transaction on the I2C bus, sending a given number of
 * bytes. The bytes in the supplied buffer must be sent to the given address. If
 * the slave device does not acknowledge any of the bytes, an error shall be
 * returned.
 *
 * @param address 7-bit I2C address to write to
 * @param data    pointer to the buffer containing the data to write
 * @param count   number of bytes to read from the buffer and send over I2C
 * @returns 0 on success, error code otherwise
 */
int8_t sensirion_i2c_write(uint8_t address, const uint8_t* data,
                           uint16_t count) {
    // IMPLEMENT
    uint8_t ret = 0xff;
    ret = sensirion_i2c_WriteByte_timeout(address,data,count);
    printf("sensirion_i2c_hal_write,address:0x%x,data:0x%x,count:%d \r\n",address,*data,count);
    if(ret != I2C_END ){//i2c_WriteByte Fail
        printf("i2c_WriteByte Fail:%d\r\n",ret);
        return STATUS_FAIL;
    }
    return NO_ERROR;
}

/**
 * Sleep for a given number of microseconds. The function should delay the
 * execution for at least the given time, but may also sleep longer.
 *
 * Despite the unit, a <10 millisecond precision is sufficient.
 *
 * @param useconds the sleep time in microseconds
 */
void sensirion_sleep_usec(uint32_t useconds) {
    // IMPLEMENT
    if(useconds % 1000 == 0){
        uint32_t mseconds = useconds /1000;
        delay_1ms(mseconds);
    }
}

//add
#ifndef I2C1_OWN_ADDRESS7 
#define I2C1_OWN_ADDRESS7      0x82
#endif

//add-sensirion-some-api
//(including init. config i2c pin,clk, ....  send one byte and so on)
void sensirion_i2c_WriteOneByte(uint8_t Addr,uint8_t data){
    #ifdef GD32E230
    /* wait until I2C bus is idle */
    while(i2c_flag_get(I2C1, I2C_FLAG_I2CBSY));
    //printf("sensirion_i2c_WriteOneByte,#1,data:%d \r\n ",data);
    i2c_start_on_bus(I2C1);//i2c_start
    
    while(!i2c_flag_get(I2C1, I2C_FLAG_SBSEND));
    //printf("sensirion_i2c_WriteOneByte,#11,address:0x%x \r\n ",Addr);

    i2c_master_addressing(I2C1,(Addr << 1),I2C_TRANSMITTER);
    //printf("i2c_master_addressing,ok\r\n ");
    
    while(!i2c_flag_get(I2C1, I2C_FLAG_ADDSEND));
    //printf("sensirion_i2c_WriteOneByte,#2 \r\n ");
    i2c_flag_clear(I2C1, I2C_FLAG_ADDSEND);
    
    while(!i2c_flag_get(I2C1, I2C_FLAG_TBE));
    //printf("sensirion_i2c_WriteOneByte,#3 \r\n ");

    i2c_data_transmit(I2C1,data);//data
    while(!i2c_flag_get(I2C1, I2C_FLAG_BTC));
    i2c_stop_on_bus(I2C1);
    
    while(I2C_CTL1(I2C1)&0x0200);
    #endif
    //delay_1ms(10);
    //PR_DEBUG("#sensirion_i2c_WriteOneByte#,ok \r\n");
}

