teleger/GD32L235-Demo/Template/Keil_project/SHT4X-5.3/sensirion_hw_i2c_implementation.c
#if 0
void sensirion_i2c_WriteByte(uint8_t Addr,const uint8_t *data,uint16_t count){
    /* wait until I2C bus is idle */
    while(i2c_flag_get(I2C1, I2C_FLAG_I2CBSY));
    //printf("sensirion_i2c_WriteByte,#1,data:%d \r\n ",data);
    i2c_start_on_bus(I2C1);//i2c_start
    
    while(!i2c_flag_get(I2C1, I2C_FLAG_SBSEND));
    //printf("sensirion_i2c_WriteByte,#11,address:0x%x \r\n ",Addr);

    i2c_master_addressing(I2C1,(Addr << 1),I2C_TRANSMITTER);
    //printf("i2c_master_addressing,ok\r\n ");
    
    while(!i2c_flag_get(I2C1, I2C_FLAG_ADDSEND));
    //printf("sensirion_i2c_WriteByte,#2 \r\n ");
    i2c_flag_clear(I2C1, I2C_FLAG_ADDSEND);
    
    while(!i2c_flag_get(I2C1, I2C_FLAG_TBE));
    //printf("sensirion_i2c_WriteByte,#3 \r\n ");

    while(count){
        i2c_data_transmit(I2C1,*data);//data
        data++;
        count--;
        while(!i2c_flag_get(I2C1, I2C_FLAG_BTC));
    }
    
    i2c_stop_on_bus(I2C1);
    while(I2C_CTL1(I2C1)&0x0200);

    PR_DEBUG("#sensirion_i2c_WriteByte#,ok \r\n");
}

void sensirion_i2c_ReadByte(uint8_t Addr,uint8_t *data,uint16_t count){
    i2c_ackpos_config(I2C1, I2C_ACKPOS_NEXT);

    /* wait until I2C bus is idle */
    while(i2c_flag_get(I2C1, I2C_FLAG_I2CBSY));
    //PR_DEBUG("sensirion_i2c_ReadOneByte,#1,data:%d \r\n",data);
    i2c_start_on_bus(I2C1);//i2c_start
    
    while(!i2c_flag_get(I2C1, I2C_FLAG_SBSEND));
    //PR_DEBUG("sensirion_i2c_ReadOneByte,#11,address:0x%x \r\n ",Addr);

    i2c_master_addressing(I2C1,(Addr << 1),I2C_RECEIVER);
    //PR_DEBUG("i2c_master_addressing,ok\r\n ");

    /* disable ACK before clearing ADDSEND bit */
    //i2c_ack_config(I2C1, I2C_ACK_DISABLE);

    while(!i2c_flag_get(I2C1, I2C_FLAG_ADDSEND));
    //PR_DEBUG("sensirion_i2c_ReadOneByte,#2 \r\n ");
    i2c_flag_clear(I2C1, I2C_FLAG_ADDSEND);

    #if (1)
    // /* Wait until the last data byte is received into the shift register */
    //while(!i2c_flag_get(I2C1, I2C_FLAG_BTC));
    //PR_DEBUG("i2c_flag_get,I2C_FLAG_BTC,ok,ok,#22 \r\n ");
    /* wait until the RBNE bit is set */
    while(count){
        if(count == 1){
            i2c_ackpos_config(I2C1, I2C_ACKPOS_CURRENT);
            i2c_ack_config(I2C1, I2C_ACK_DISABLE);
        }
        if(i2c_flag_get(I2C1, I2C_FLAG_RBNE)){
            *data = i2c_data_receive(I2C1);
            i2c_ack_config(I2C1, I2C_ACK_ENABLE);
            data++;
            count--;
        }
    }
    PR_DEBUG("ReadByte\r\n ");
    #else
        for(i=0; i<3; i++){
            if(0 == i){
                /* wait until the second last data byte is received into the shift register */
                while(!i2c_flag_get(I2C1, I2C_FLAG_BTC));
                /* disable acknowledge */
                i2c_ack_config(I2C1, I2C_ACK_DISABLE);
            }
            /* wait until the RBNE bit is set */
            while(!i2c_flag_get(I2C1, I2C_FLAG_RBNE));
            /* read a data from I2C_DATA */
            data1 = i2c_data_receive(I2C1);
            PR_DEBUG("i2c_data_receive,ok,ok::%d #22 \r\n ",data1);
        }
    #endif
    
    /* send a stop condition */
    i2c_stop_on_bus(I2C1);
    while(I2C_CTL1(I2C1)&0x0200);
    i2c_ackpos_config(I2C1, I2C_ACKPOS_CURRENT);
    /* enable acknowledge */
    i2c_ack_config(I2C1, I2C_ACK_ENABLE);

    PR_DEBUG("sensirion_i2c_ReadByte,end \r\n ");
}
#endif

//add
uint8_t sensirion_i2c_WriteByte_timeout(uint8_t Addr,const uint8_t *data,uint16_t count){
    #ifdef  GD32E230
    uint8_t     state = I2C_START;
    uint16_t    timeout = 0;
    uint8_t     i2c_timeout_flag = 0;
    while(!(i2c_timeout_flag)){
        switch (state)
        {
        case I2C_START:
            while(i2c_flag_get(I2C1, I2C_FLAG_I2CBSY) && (timeout < I2C_TIME_OUT)){
                timeout++;
            }
            if(timeout < I2C_TIME_OUT){
                i2c_start_on_bus(I2C1);//i2c_start
                timeout = 0;
                state = I2C_SEND_ADDRESS;
            }else{
                timeout = 0;
                state = I2C_START;
                i2c_timeout_flag = I2C_OK;
                //PR_ERR("%s,i2c bus is busy in byte write \r\n",SENSIR_STR);
            }
            break;
        case I2C_SEND_ADDRESS:
            /* i2c master sends START signal successfully */
            while((!i2c_flag_get(I2CX, I2C_FLAG_SBSEND)) && (timeout < I2C_TIME_OUT)){
                timeout++;
            }
            if(timeout < I2C_TIME_OUT){
                i2c_master_addressing(I2CX, (Addr << 1), I2C_TRANSMITTER);
                timeout = 0;
                state = I2C_CLEAR_ADDRESS_FLAG;
            }else{
                timeout = 0;
                state = I2C_START;
                i2c_timeout_flag = I2C_OK;
                //PR_ERR("%s,i2c master sends start signal timeout in BYTE WRITE!\r\n",SENSIR_STR);
            }
            break;
        case I2C_CLEAR_ADDRESS_FLAG:
            /* address flag set means i2c slave sends ACK */
            while((!i2c_flag_get(I2CX, I2C_FLAG_ADDSEND)) && (timeout < I2C_TIME_OUT)){
                timeout++;
            }
            if(timeout < I2C_TIME_OUT){
                i2c_flag_clear(I2CX, I2C_FLAG_ADDSEND);
                timeout = 0;
                state = I2C_TRANSMIT_DATA;
            }else{
                timeout = 0;
                state = I2C_START;
                //add 提前退出循环
                i2c_timeout_flag = I2C_OK;
                //PR_ERR("%s,i2c master clears address flag timeout in BYTE WRITE!\r\n",SENSIR_STR);
            }
            break;
        case I2C_TRANSMIT_DATA:
            /* wait until the transmit data buffer is empty */
            while((!i2c_flag_get(I2CX, I2C_FLAG_TBE)) && (timeout < I2C_TIME_OUT)){
                timeout++;
            }

            while(count)
            {
                i2c_data_transmit(I2CX, *data);
                data++;
                count--;
                while((!i2c_flag_get(I2CX, I2C_FLAG_BTC)) && (timeout < I2C_TIME_OUT)){
                    timeout++;
                }
                if(timeout < I2C_TIME_OUT){
                    timeout = 0;
                }else{
                    timeout = 0;
                    state = I2C_START;
                    i2c_timeout_flag = I2C_OK;
                    //PR_ERR("%s,i2c master sends data timeout in PAGE WRITE!\n",SENSIR_STR);
                    break;
                }
            }
            state = I2C_STOP;
            timeout = 0;
            break;
        case I2C_STOP:
            /* send a stop condition to I2C bus */
            i2c_stop_on_bus(I2CX);
            /* i2c master sends STOP signal successfully */
            while((I2C_CTL1(I2CX) & 0x0200) && (timeout < I2C_TIME_OUT)){
                timeout++;
            }
            if(timeout < I2C_TIME_OUT){
                timeout = 0;
                state = I2C_END;
                i2c_timeout_flag = I2C_OK;
            }else{
                timeout = 0;
                state = I2C_START;
                //PR_ERR("%s,i2c master sends stop signal timeout in BYTE WRITE\r\n",SENSIR_STR);
            }
            break;
        default:
            state = I2C_START;
            i2c_timeout_flag = I2C_OK;
            timeout = 0;
            //PR_DEBUG("%s,i2c master sends start signal in BYTE WRITE!\r\n",SENSIR_STR);
            break;
        }
    }
    #endif

