teleger/GD32L235-Demo/Template/Keil_project/SHT4X-5.3/sensirion_hw_i2c_implementation.c
    #ifdef GD32L235
    i2c_process_enum        state = I2C_START;
    uint16_t                timeout = 0;
    uint8_t                 end_flag = 0;
    i2c_transfer_byte_number_config(I2C0, 16);
    i2c_master_addressing(I2C0, Addr<<1, I2C_MASTER_TRANSMIT);
    printf("i2c_master_addressing:0x%x\r\n",Addr<<1);
    while(!(end_flag)){
        printf("IIC writeByte,state: %d\r\n",state);
        switch(state){
            case I2C_START:
                I2C_STAT(I2C0) |= I2C_STAT_TBE;
                while(i2c_flag_get(I2C0, I2C_FLAG_I2CBSY) && (timeout < I2C_TIME_OUT)){
                    timeout++;
                }
                if(timeout < I2C_TIME_OUT){
                    i2c_start_on_bus(I2C0);
                    timeout = 0;
                    state = I2C_SEND_ADDRESS;
                }else{
                    timeout = 0;
                    state = I2C_START;
                    end_flag = I2C_OK;
                    printf("i2c bus is busy in  writeByte! %d\r\n",__LINE__);
                }
                break;
            case I2C_SEND_ADDRESS:
                while((!i2c_flag_get(I2C0, I2C_FLAG_TBE)) && (timeout < I2C_TIME_OUT)){
                    timeout++;
                }
                if(timeout < I2C_TIME_OUT){
                    timeout = 0;
                    i2c_data_transmit(I2C0, Addr<<1);
                    state = I2C_TRANSMIT_DATA;
                }else{
                    timeout = 0;
                    state = I2C_START;
                    printf("i2c master sends 's internal address timeout in  writeByte!\r\n");
                }
                break;
            case I2C_TRANSMIT_DATA:
                printf("i2c TI:%d! \r\n",i2c_flag_get(I2C0, I2C_FLAG_TI));
                printf("i2c TBE:%d! \r\n",i2c_flag_get(I2C0, I2C_FLAG_TBE));
                printf("i2c NCK:%d! \r\n",i2c_flag_get(I2C0, I2C_FLAG_NACK));
                while((!i2c_flag_get(I2C0, I2C_FLAG_TBE)) && (timeout < I2C_TIME_OUT)){
                    timeout++;
                }
                if(timeout < I2C_TIME_OUT){
                    timeout = 0;
                    i2c_data_transmit(I2C0, *data);
                    state = I2C_STOP;
                }else{
                    timeout = 0;
                    state = I2C_START;
                    printf("i2c master sends data timeout in  writeByte! \r\n");
                }
                printf("i2c_step2 NCK:%d! \r\n",i2c_flag_get(I2C0, I2C_FLAG_NACK));
                break;
            case I2C_STOP:
                /* send a stop condition to I2C bus */
                i2c_stop_on_bus(I2C0);
                /* i2c master sends STOP signal successfully */
                while(!i2c_flag_get(I2C0, I2C_FLAG_STPDET) && (timeout < I2C_TIME_OUT)){
                    timeout++;
                }
                if(timeout < I2C_TIME_OUT){
                    timeout = 0;
                    state = I2C_END;
                    end_flag = I2C_OK;
                    /* clear the STPDET bit */
                    i2c_flag_clear(I2C0, I2C_FLAG_STPDET);
                }else{
                    timeout = 0;
                    state   = I2C_START;
                    printf("i2c master sends stop signal timeout in  writeByte!\r\n");
                }
                printf("i2c_step3 NCK:%d! \r\n",i2c_flag_get(I2C0, I2C_FLAG_NACK));
                break;
        default:
            state = I2C_START;
            end_flag = I2C_OK;
            timeout = 0;
            printf("i2c master sends start signal in  WRITE!\r\n");
            break;
        }
    }
    #endif
    return state;
}

uint8_t sensirion_i2c_ReadByte_timeout(uint8_t Addr,uint8_t *data,uint16_t count){
    // IMPLEMENT
    #ifdef GD32E230
    uint8_t     state = I2C_START;
    uint16_t    timeout = 0;
    uint8_t     i2c_timeout_flag = 0;
    i2c_ackpos_config(I2C1, I2C_ACKPOS_NEXT);
    while(!(i2c_timeout_flag)){
        switch (state)
        {
        case I2C_START:
            while(i2c_flag_get(I2CX, I2C_FLAG_I2CBSY) && (timeout < I2C_TIME_OUT)){
                timeout++;
            }
            if(timeout < I2C_TIME_OUT){
                i2c_start_on_bus(I2C1);//i2c_start
                timeout = 0;
                state = I2C_SEND_ADDRESS;
            }else{
                timeout = 0;
                state = I2C_START;
                //PR_DEBUG("i2c bus is busy in byte read \r\n");
            }
            break;
        case I2C_SEND_ADDRESS:
            /* i2c master sends START signal successfully */
            while((!i2c_flag_get(I2CX, I2C_FLAG_SBSEND)) && (timeout < I2C_TIME_OUT)){
                timeout++;
            }
            if(timeout < I2C_TIME_OUT){
                i2c_master_addressing(I2CX, (Addr << 1), I2C_RECEIVER);
                timeout = 0;
                state = I2C_CLEAR_ADDRESS_FLAG;
            }else{
                timeout = 0;
                state = I2C_START;
                //add //提前退出循环
                i2c_timeout_flag = I2C_OK;
                //PR_DEBUG("i2c master sends start signal timeout in BYTE READ!\n");
            }
            break;
        case I2C_CLEAR_ADDRESS_FLAG:
            /* address flag set means i2c slave sends ACK */
            while((!i2c_flag_get(I2CX, I2C_FLAG_ADDSEND)) && (timeout < I2C_TIME_OUT)){
                timeout++;
            }
            if(timeout < I2C_TIME_OUT){
                i2c_flag_clear(I2CX, I2C_FLAG_ADDSEND);
                timeout = 0;
                state = I2C_TRANSMIT_DATA;
            }else{
                timeout = 0;
                state = I2C_START;
                //add //提前退出循环
                i2c_timeout_flag = I2C_OK;
                //PR_DEBUG("i2c master clears address flag timeout in BYTE WRITE!\n");
            }
            break;
        case I2C_TRANSMIT_DATA:
             /* wait until the transmit data buffer is empty */
            while((!i2c_flag_get(I2CX, I2C_FLAG_TBE)) && (timeout < I2C_TIME_OUT)){
                timeout++;
            }
            while(count){
                if(count == 1){
                    i2c_ackpos_config(I2C1, I2C_ACKPOS_CURRENT);
                    i2c_ack_config(I2C1, I2C_ACK_DISABLE);
                }
                if(i2c_flag_get(I2C1, I2C_FLAG_RBNE)){
                    *data = i2c_data_receive(I2C1);
                    i2c_ack_config(I2C1, I2C_ACK_ENABLE);
                    data++;
                    count--;
                }else{
                    state = I2C_START;
                    timeout = 0;
                }
            }
            state = I2C_STOP;
            timeout = 0;
            break;
        case I2C_STOP:
            /* send a stop condition to I2C bus */
            i2c_stop_on_bus(I2CX);
            /* i2c master sends STOP signal successfully */
            while((I2C_CTL1(I2CX) & 0x0200) && (timeout < I2C_TIME_OUT)){
                timeout++;
            }
            if(timeout < I2C_TIME_OUT){
                i2c_ackpos_config(I2C1, I2C_ACKPOS_CURRENT);
                /* enable acknowledge */
                i2c_ack_config(I2C1, I2C_ACK_ENABLE);
                
                timeout = 0;
                state = I2C_END;
                i2c_timeout_flag = I2C_OK;
            }else{
                timeout = 0;
                state = I2C_START;
                //PR_DEBUG("i2c master sends stop signal timeout in BYTE READ\n");
            }
            break;
        default:
            state = I2C_START;
            i2c_timeout_flag = I2C_OK;
            timeout = 0;
            //PR_DEBUG("i2c master sends start signal in BYTE READ!\n");
            break;
        }
    }
    #endif

