teleger/GD32L235-Demo/Template/Keil_project/SHT4X-5.3/sensirion_hw_i2c_implementation.c
    #ifdef GD32L235
    i2c_process_enum    state = I2C_START;
    uint32_t            timeout = 0;
    uint8_t             end_flag = 0;
    //i2c_nack_disable(I2CX);
    i2c_transfer_byte_number_config(I2CX, count);
    while(!(end_flag))
    {
        //printf("i2c bus is busy in read_state:%d,LINE: %d!\r\n",state,__LINE__);
        switch (state)
        {
        case I2C_START:
            /* configure number of bytes to be transferred */
            while(i2c_flag_get(I2CX, I2C_FLAG_I2CBSY) && (timeout < I2C_TIME_OUT)) 
            {
                timeout++;
            }
            if(timeout < I2C_TIME_OUT) {
                i2c_start_on_bus(I2CX);
                timeout = 0;
                state = I2C_SEND_ADDRESS;
            } else {
                /* timeout, bus reset */
                //i2c_bus_reset();
                timeout = 0;
                state = I2C_START;
                printf("i2c bus is busy in read_%d!\r\n",__LINE__);
            }
            break;
        case I2C_SEND_ADDRESS:
            while((!i2c_flag_get(I2CX, I2C_FLAG_TBE)) && (timeout < I2C_TIME_OUT)) {
                timeout++;
            }
            if(timeout < I2C_TIME_OUT) {
                i2c_data_transmit(I2CX, (Addr<<1)|(0x01));
                state = I2C_TRANSMIT_DATA;
            }
            break;
        case I2C_TRANSMIT_DATA:
            i2c_nack_disable(I2CX);
            i2c_master_addressing(I2CX, Addr, I2C_MASTER_RECEIVE);
            while(count)
            {
                if(count ==  1){
                    i2c_nack_enable(I2CX);
                }
                if(i2c_flag_get(I2CX, I2C_FLAG_RBNE)){
                    *data = i2c_data_receive(I2CX);
                    data++;
                    count--;
                    printf("i2c_data_receive ing:%d\r\n",*data);
                }
            }
            printf("***********************************************\r\n");
            printf("i2c RBNE:%d\r\n",i2c_flag_get(I2CX, I2C_FLAG_RBNE));
            printf("i2c NCK:%d! \r\n",i2c_flag_get(I2CX, I2C_FLAG_NACK));
            printf("i2c TI:%d! \r\n",i2c_flag_get(I2CX, I2C_FLAG_TI));
            printf("i2c TBE:%d! \r\n",i2c_flag_get(I2CX, I2C_FLAG_TBE));
            printf("i2c ADDSEND:%d! \r\n",i2c_flag_get(I2CX, I2C_FLAG_ADDSEND));
            printf("***********************************************\r\n");
            state = I2C_STOP;
            timeout = 0;
            printf("i2c transmit complete %d \r\n",i2c_flag_get(I2CX, I2C_FLAG_RBNE));
            break;
        case I2C_STOP:
            /* wait until the stop condition is finished */
            while((!i2c_flag_get(I2CX, I2C_FLAG_STPDET)) && (timeout < I2C_TIME_OUT)) {
                timeout++;
            }
            if(timeout < I2C_TIME_OUT) {
                /* clear STPDET flag */
                i2c_flag_clear(I2CX, I2C_FLAG_STPDET);
                timeout = 0;
                state = I2C_END;
                end_flag = 1;
            } else {
                timeout = 0;
                state = I2C_START;
                printf("i2c master sends stop signal timeout in read!\n");
            }
            break;
        default:
            /* default status */
            state = I2C_START;
            end_flag = 1;
            timeout = 0;
            printf("i2c master sends start signal in read!\n");
            break;
        }
    }
    #endif
    return state;
}

void sensirion_i2c_gpio_config(){
    #ifdef GD32E230
    /* connect PA0 to I2C1_SCL */
    gpio_af_set(GPIOA, GPIO_AF_4, GPIO_PIN_0);
    /* connect PA1 to I2C1_SDA */
    gpio_af_set(GPIOA, GPIO_AF_4, GPIO_PIN_1);
    /* configure GPIO pins of I2C1 */
    gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_0);
    gpio_output_options_set(GPIOA, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_0);
    gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_1);
    gpio_output_options_set(GPIOA, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_1);
    #endif
    #ifdef GD32L235
    /* connect PB8 to I2C0_SCL */
    gpio_af_set(GPIOB, GPIO_AF_4, GPIO_PIN_8);
    /* connect PB9 to I2C0_SDA */
    gpio_af_set(GPIOB, GPIO_AF_4, GPIO_PIN_9);
    /* configure GPIO pins of I2C0 */
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_8);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_8);
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_9);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_9);
    #endif
}

void sensirion_i2c_rcu_config(){
    /* enable GPIOB clock */
    rcu_periph_clock_enable(RCU_GPIOB);
    /* enable I2C0 clock */
    rcu_periph_clock_enable(RCU_I2C0);
}

void sensirion_i2c_attribute_config(){
    #ifdef GD32E230
    /* I2C clock configure */
    i2c_clock_config(I2C1, 100000, I2C_DTCY_2);
    /* I2C address configure */
    i2c_mode_addr_config(I2C1, I2C_I2CMODE_ENABLE, I2C_ADDFORMAT_7BITS, I2C1_OWN_ADDRESS7);
    /* enable I2C1 */
    i2c_enable(I2C1);
    /* enable acknowledge */
    i2c_ack_config(I2C1, I2C_ACK_ENABLE);
    #endif

    #ifdef GD32L235
    /* configure I2C timing */
    i2c_timing_config(I2C0, 0, 0x3, 0);
    i2c_master_clock_config(I2C0, 0x13, 0x36);
    i2c_address_config(I2C0, I2C1_OWN_ADDRESS7, I2C_ADDFORMAT_7BITS);
    /* configure slave address */
    //i2c_master_addressing(I2C0, 0x82, I2C_MASTER_TRANSMIT);
    /* enable I2C0 */
    i2c_enable(I2C0);
    #endif
}